1. Vypi≈° si prvn√≠ch nƒõkolik ≈ô√°dk≈Ø, a≈• si prohl√©dne≈° strukturu tabulky.

In [14]:
import pandas as pd
seznam = pd.read_csv("temperature.csv", sep=",")
seznam.head()

   Region  Country     City  Day  AvgTemperature
0  Africa  Algeria  Algiers    1            62.0
1  Africa  Algeria  Algiers    2            62.2
2  Africa  Algeria  Algiers    3            65.7
3  Africa  Algeria  Algiers    4            69.8
4  Africa  Algeria  Algiers    5            63.8

2. Dotaz na mƒõ≈ôen√≠, kter√° byla provedena v Praze. Je na datech nƒõco zvl√°≈°tn√≠ho?

In [55]:
praha = seznam[seznam["City"] == "Prague"]
print("\n Hodnoty namƒõ≈ôen√© v Praze jsou: ")
praha.head()

 Hodnoty namƒõ≈ôen√© v Praze jsou:

      Region         Country    City  Day  AvgTemperature
2100  Europe  Czech Republic  Prague    1            43.5
2101  Europe  Czech Republic  Prague    2            48.5
2102  Europe  Czech Republic  Prague    3            44.4
2103  Europe  Czech Republic  Prague    4            39.7
2104  Europe  Czech Republic  Prague    5            40.6

3. Dotaz na mƒõ≈ôen√≠, ve kter√Ωch je teplota (sloupec AvgTemperature) vy≈°≈°√≠ ne≈æ 80 stup≈à≈Ø.

In [60]:
teplota_nad_80 = seznam[seznam["AvgTemperature"] > 80]
print("\n Mƒõ≈ôen√≠ u kter√Ωch byla teplota vy≈°≈°√≠ nƒõ≈æ 80: ")
teplota_nad_80.head()

 Mƒõ≈ôen√≠ u kter√Ωch byla teplota vy≈°≈°√≠ nƒõ≈æ 80:

    Region Country     City  Day  AvgTemperature
30  Africa   Benin  Cotonou    1            81.7
31  Africa   Benin  Cotonou    2            81.8
32  Africa   Benin  Cotonou    3            83.6
33  Africa   Benin  Cotonou    4            83.4
34  Africa   Benin  Cotonou    5            80.3

4. Dotaz na mƒõ≈ôen√≠, ve kter√Ωch je teplota vy≈°≈°√≠ ne≈æ 60 stup≈à≈Ø a souƒçasnƒõ bylo mƒõ≈ôen√≠ provedeno v regionu (sloupec Region) Evropa (Europe).

In [64]:
vysok√°_teplota_evropske_staty = seznam[
    (seznam["AvgTemperature"] > 60) & (seznam["Region"] == "Europe")
]
print("\n Evropsk√© st√°ty u kter√Ωch teplota p≈ôes√°hla 60: ")
vysok√°_teplota_evropske_staty.head()

 Evropsk√© st√°ty u kter√Ωch teplota p≈ôes√°hla 60:

      Region   Country    City  Day  AvgTemperature
1932  Europe   Albania  Tirana   13            60.3
2402  Europe     Italy    Rome    3            62.2
2404  Europe     Italy    Rome    5            60.4
2580  Europe  Portugal  Lisbon    1            62.5
2581  Europe  Portugal  Lisbon    2            63.2

5. Dotaz na extr√©mn√≠ hodnoty, tj. mƒõ≈ôen√≠, ve kter√Ωch je teplota vy≈°≈°√≠ ne≈æ 80 stup≈à≈Ø nebo men≈°√≠ ne≈æ -20 stup≈à≈Ø.

In [77]:
extremni_teploty = seznam[
    (seznam["AvgTemperature"] > 60) | (seznam["AvgTemperature"] < -20)
]
print("\n St√°ty u kter√Ωch byla namƒõ≈ôen√° extr√©mn√≠ teplota: ")
extremni_teploty.iloc[510:515]

 St√°ty u kter√Ωch byla namƒõ≈ôen√° extr√©mn√≠ teplota:

     Region  Country   City  Day  AvgTemperature  AvgTemperatureCelsia
563  Africa  Nigeria  Lagos   24           -99.0                -72.78
564  Africa  Nigeria  Lagos   25           -99.0                -72.78
565  Africa  Nigeria  Lagos   26           -99.0                -72.78
566  Africa  Nigeria  Lagos   27            85.1                 29.50
567  Africa  Nigeria  Lagos   28            82.1                 27.83

üîµ BONUS 1

Nainstaluj si modul pytemperature a zkus si vytvo≈ôit nov√Ω sloupec, kter√Ω bude obsahovat pr≈Ømƒõrnou templotu ve stupn√≠ch Celsia.
üöÄpip install pytemperature

Ve sv√©m programu nejprve proveƒè import modulu pytemperature. Nov√Ω sloupec pak p≈ôid√°≈° do tabulky tak, ≈æe nalevo od = vlo≈æ√≠≈° tabulku a n√°zev nov√©ho sloupce do hranat√Ωch z√°vorek. Napravo pak m≈Ø≈æe≈° prov√°dƒõt v√Ωpoƒçty pomoc√≠ ji≈æ existuj√≠c√≠ch sloupc≈Ø. M≈Ø≈æe≈° nap≈ô. pou≈æ√≠t funkci f2c z modulu pytemperature, kter√° p≈ôevede teplotu ze stup≈à≈Ø Fahrenheita na stupnƒõ Celsia.

In [82]:
import pytemperature
seznam["AvgTemperatureCelsia"] = pytemperature.f2c(seznam["AvgTemperature"])
seznam.head(1)

   Region  Country     City  Day  AvgTemperature  AvgTemperatureCelsia
0  Africa  Algeria  Algiers    1            62.0                 16.67

1. Dotaz na mƒõ≈ôen√≠, ve kter√Ωch je teplota (sloupec AvgTemperatureCelsia) vy≈°≈°√≠ ne≈æ 30 stup≈à≈Ø Celsia.

In [84]:
stupnƒõ_nad_30 = seznam[seznam["AvgTemperatureCelsia"] > 30]
print("\n Mƒõ≈ôen√≠ u kter√Ωch teplota p≈ôes√°hla 30 stup≈à≈Ø Celsia: ")
stupnƒõ_nad_30.head()

 Mƒõ≈ôen√≠ u kter√Ωch teplota p≈ôes√°hla 30 stup≈à≈Ø Celsia:

     Region     Country        City  Day  AvgTemperature  AvgTemperatureCelsia
421  Africa  Mauritania  Nouakchott    2            87.4                 30.78
430  Africa  Mauritania  Nouakchott   11            87.1                 30.61
510  Africa     Nigeria      Niamey    1            86.9                 30.50
526  Africa     Nigeria      Niamey   17            86.3                 30.17
527  Africa     Nigeria      Niamey   18            86.6                 30.33

2. Dotaz na mƒõ≈ôen√≠, ve kter√Ωch je teplota vy≈°≈°√≠ ne≈æ 15 stup≈à≈Ø Celsia a souƒçasnƒõ bylo mƒõ≈ôen√≠ provedeno v regionu (sloupec Region) Evropa (Europe).

In [86]:
stupnƒõ_nad_15_eu = seznam[
    (seznam["AvgTemperatureCelsia"] > 15) & (seznam["Region"] == "Europe")
]
print("\n Evropsk√© st√°ty u kter√Ωch teplota p≈ôes√°hla 15 stup≈à≈Ø Celsia: ")
stupnƒõ_nad_15_eu.head()

 Evropsk√© st√°ty u kter√Ωch teplota p≈ôes√°hla 15 stup≈à≈Ø Celsia:

      Region  Country      City  Day  AvgTemperature  AvgTemperatureCelsia
1932  Europe  Albania    Tirana   13            60.3                 15.72
2221  Europe   France  Bordeaux    2            59.2                 15.11
2402  Europe    Italy      Rome    3            62.2                 16.78
2404  Europe    Italy      Rome    5            60.4                 15.78
2424  Europe    Italy      Rome   25            59.3                 15.17

3. Dotaz na extr√©mn√≠ hodnoty, tj. mƒõ≈ôen√≠, ve kter√Ωch je teplota vy≈°≈°√≠ ne≈æ 30 stup≈à≈Ø Celsia nebo men≈°√≠ ne≈æ -10 stup≈à≈Ø. Jsou nƒõkter√© hodnoty podez≈ôel√©?

In [94]:
extremni_teploty_celsia = seznam[
    (seznam["AvgTemperatureCelsia"] > 30) | (seznam["AvgTemperatureCelsia"] < -10)
]
print("\n Hodnoty u kter√Ωch bylo namƒõ≈ôeno v√≠ce ne≈æ 30 stup≈à≈Ø Celsia nebo m√©nƒõ ne≈æ -10 stup≈à≈Ø: ")
extremni_teploty_celsia.head()

 Hodnoty u kter√Ωch bylo namƒõ≈ôeno v√≠ce ne≈æ 30 stup≈à≈Ø Celsia nebo m√©nƒõ ne≈æ -10 stup≈à≈Ø:

     Region   Country         City  Day  AvgTemperature  AvgTemperatureCelsia
168  Africa  Ethiopia  Addis Ababa   19           -99.0                -72.78
212  Africa    Gambia       Banjul    3           -99.0                -72.78
213  Africa    Gambia       Banjul    4           -99.0                -72.78
214  Africa    Gambia       Banjul    5           -99.0                -72.78
215  Africa    Gambia       Banjul    6           -99.0                -72.78

üîµ BONUS 2
1. Dotaz na ≈ô√°dky z 13. listopadu 2017 (sloupec Day mus√≠ m√≠t hodnotu 13).

In [98]:
listopad13 = seznam[seznam["Day"] == 13]
print("\n Hodnoty kter√© byly namƒõ≈ôeny dne 13.11.2017: ")
listopad13.head()

 Hodnoty kter√© byly namƒõ≈ôeny dne 13.11.2017:

,Region,Country,City,Day,AvgTemperature,AvgTemperatureCelsia
12,Africa,Algeria,Algiers,13,54.1,12.28
42,Africa,Benin,Cotonou,13,84.1,28.94
72,Africa,Central African Republic,Bangui,13,79.0,26.11
102,Africa,Congo,Brazzaville,13,79.6,26.44
132,Africa,Egypt,Cairo,13,72.4,22.44

2. Dotaz na ≈ô√°dky z 13. listopadu 2017 ze Spojen√Ωch st√°t≈Ø americk√Ωch (sloupec Day mus√≠ m√≠t hodnotu 13 a sloupec Country hodnotu US). V√Ωsledek dotazu si ulo≈æ do nov√© tabulky a pou≈æij ji jako vstup pro n√°sleduj√≠c√≠ dotaz.

In [101]:
listopad13_us = seznam[
    (seznam["Day"] == 13) & (seznam["Country"] == "US")
]
listopad13_us.head()
listopad13_us.to_csv("listopad13_us.csv", index=False)

3. Pro data z p≈ôedchoz√≠ho dotazu napi≈° dotaz na ≈ô√°dky ve mƒõstech (sloupec City) Washington a Philadelphia.

In [104]:
us_mesta = listopad13_us[
    (listopad13_us["City"] == "Washington") | (listopad13_us["City"] == "Philadelphia")
]
us_mesta.head()

,Region,Country,City,Day,AvgTemperature,AvgTemperatureCelsia
4872,North America,US,Washington,13,45.2,7.33
4902,North America,US,Washington,13,45.2,7.33
7572,North America,US,Philadelphia,13,41.7,5.39